chat_system_2861195_actor_description=Elerio Shivarius. Archivist of the magic school.
chat_system_2861195_ispytanie_header_0=^?^Great! To tell you the truth, I didn't expect you to pass the trial.<br>By the way, watching the fight I noticed that your magic potential rose a bit. I do hope you understand that strength of will and magic can be far stronger than sword and steel.<br><br>[s]You've got some Magic Runes[/s]
chat_system_2861195_snap_0_question=^?^Yes, [player], what do you want to tell me? What brings you here back to our Magic School? Affairs of State, or is it something personal?
chat_system_2861195_snap_0_answer_0=^?^I'm looking for some magic scrolls. Show me what you have.
chat_system_2861195_snap_0_answer_1=^?^So, how about looking for some manuscripts?
chat_system_2861195_snap_0_answer_2=^?^I saw a strange speaking stone in the forest...
chat_system_2861195_snap_0_answer_3=^?^I'd like to ask you a few questions...
chat_system_2861195_snap_0_header_3=^?^Well, ask then. I hope I'll be able to give you the answers. So you're interested in...
chat_system_2861195_snap_0_answer_4=^?^I want to pass a Trial of Will!
chat_system_2861195_snap_0_answer_5=^?^I've heard that Mages are always in need of some herbs or chicken's legs for their experiments and potions. Maybe I can help you?
chat_system_2861195_snap_0_answer_6=^?^I have a bit of free time. Do you have any easy errands I might carry out for you?
chat_system_2861195_snap_0_answer_7=^?^I have a little free time, so maybe I could go searching for the animals you need.
chat_system_2861195_snap_0_header_7=^?^How commendable! I'm sure that you recognize the importance of scientific and magical research, and have determined to help us not merely for the reward, but for the furtherance of knowledge. I remind you, we need ten Lake Dragonflies, three Royal Snakes and one Cyclops.
chat_system_2861195_snap_0_answer_8=^?^I hate to leave the school's cozy walls, but I'm in a bit of a hurry. See you later!
chat_system_2861195_quest_letopisy_question=^?^Hum. I may have one easy errand for you. You just have to go over to a... woman and... collect some papers from her.<br>You'll need to go to Marshan Swamp. There you will find an old witch - Old Chvakha, she's called. Long ago, we loaned her some very valuable papers - the Lost Necromancers' Town Chronicles. Unfortunately, after our conflict with the Witch's Coven about 500 years ago, all our ties with the witches were broken, and so the papers were left with Chvakha. And now the Mages' Counsel has decided to resume the search for that town, so we are in need of the Chronicles once more.<br>So, will you go to the witch, and collect the papers from her?<br>[reward]
chat_system_2861195_quest_letopisy_answer_0=^?^Ok... This doesn't sound too difficult...
chat_system_2861195_quest_letopisy_answer_1=^?^Oh no, I don't want to squish about the swamps. I'm not interested in catching marsh fever, after all.
chat_system_2861195_snap_8_question=^?^How do you like that, a man in a hurry... But I didn't even tell you how to get there! Marshan Swamp is to the West. Search for the guide sign as you approach. To the left is a cemetery - you don't need to go there. Instead, go straight to the swamp. That's where Old Chvakha lives.
chat_system_2861195_snap_8_answer_0=^?^Ah, now I'll definitely find her. But first I want to ask you a few questions.
chat_system_2861195_snap_8_answer_1=^?^Aha! Swamps, Marsh, Witch... Ok, I got it; I'll find her directly!
chat_system_2861195_snap_1_question=^?^Speaking! And what did it say?
chat_system_2861195_snap_1_answer_0=^?^It said that one of the school's students tried to enchant it, to transform it into something unusual. But he didn't entirely succeed, and so the stone is still a common stone.
chat_system_2861195_snap_5_question=^?^Didn't succeed? Well, [player], wouldn't you say that a talking stone is itself rather an unusual thing? <br>Well at any rate, in the case of a partial magic transformation, you simply need to finish the conjuration. Then the object - in our case, a stone - will become whatever the original conjuration's author intended it to become.
chat_system_2861195_snap_5_answer_0=^?^And do you know how to finish the conjuration?
chat_system_2861195_snap_7_question=^?^Interesting... A speaking stone... I'd like to talk to the student who cast such a spell. The school's top minds have wrestled with the conjuration and animation of natural elements for scores of years...<br>Hmm, you might try the universal Zerillon's formula - "ut umus lemo canis"... Maybe it will work.
chat_system_2861195_snap_7_answer_0=^?^Thank you, I'll try it. 
chat_system_2861195_talk_question=^?^What else do you want to know? I can spare another moment...
chat_system_2861195_talk_answer_0=^?^Have you ever heard about Lyaro Island?
chat_system_2861195_talk_answer_1=^?^I'd like to know more about the Magic School.
chat_system_2861195_talk_answer_2=^?^Maybe I could learn something in your school?
chat_system_2861195_talk_answer_3=^?^What about a lost town?
chat_system_2861195_talk_answer_4=^?^Why did Mages quarrel with the Witches Coven?
chat_system_2861195_talk_answer_5=^?^How are you getting on with the deciphering?
chat_system_2861195_talk_answer_6=^?^I don't actually have questions, but I did want to clarify one thing...
chat_system_2861195_talk_header_6=^?^Yes, I'm listening. But remember that I can't spend the whole day on you.
chat_system_2861195_talk_answer_7=^?^Sorry, I didn't mean to distract you. See you later!
chat_system_2861195_snap_10_question=^?^You ask me if I heard about that Island? Actually, I was a member of the very first investigatory expedition.<br>Together with my colleagues I attempted to discover what mysterious forces raised the island from the depths of the sea. Alas, we didn't manage to find much. Yes, a Superior Magic ceremony had been performed, complete with a sacrifice, but the rite itself had nothing to do with either classic or divine magic. It rather resembled Death Magic, but... something more ancient and strange...<br>Maybe the Titan's Powers were used? But this kind of magic has long been forgotten. Only the oldest of old orc shamans have managed to preserve some crumbs of this knowledge... I don't know...
chat_system_2861195_snap_10_answer_0=^?^Hmm... Sounds strange...
chat_system_2861195_switch_1_header_0=^?^Darion Magic School was founded by the former mage-lecturer of the Academy, Archmage Goyen Waldi, better known as Waldares the Winged.<br>Together with two of his former students he bought a half-ruined house on the city outskirts and began to teach basic magic to the children there talented enough to learn. Decades passed, and a modest school turned into what you see now - the Darion Magic School, where scores of the greatest sorcerers teach young mages who come not only from Darion, but from all across the world. We even have two elves studying here!<br>Here we teach reading and writing, literature and languages, history and philosophy, herbalism, astronomy and, of course, magic. Nearly thirty theoretical and practical courses are available - from spell design to battle magic basics. And starting this year we introduced a couple of courses that even the central Magic Academy doesn't offer!
chat_system_2861195_snap_9_question=^?^Learn something? Hum... But didn't you graduate from the Knight's School at the Temple?
chat_system_2861195_snap_9_answer_0=^?^I would like to see what kind of mage I am. Our protective sorcery mentor, Aldares, told me that I may have some ability.
chat_system_2861195_snap_9_answer_1=^?^I'm sure that Knight's School mentors teach us better than you sorcerers, and I'm ready to prove it!
chat_system_2861195_snap_9_answer_2=^?^I think I want to talk about something else.
chat_system_2861195_snap_6_question=^?^Hum. Maybe you wish to pass one of the trials that our students and adherents pass? Many of them would be difficult for you, but some could be useful. I can permit you to enter a Trial of Will...
chat_system_2861195_snap_6_answer_0=^?^Trial of Will... sounds pretty interesting. Tell me more!
chat_system_2861195_snap_6_answer_1=^?^Let's talk about it next time.
chat_system_2861195_snap_6_header_1=^?^As you wish, young knight.
chat_system_2861195_snap_4_question=^?^Students enter this trial on the second month of training. In fact, there's nothing extraordinary about it. It's simply a lot of combat training, against an enemy with superior forces. But in this combat you'll have to rely on magic only; no combat skills will help you.<br>The Trial sometimes enables students to discover new talents. Maybe you'll learn something too, who knows...
chat_system_2861195_snap_4_answer_0=^?^[s]Normal difficulty[/s] Sounds interesting! Maybe I'll try my hand at this trial.
chat_system_2861195_snap_4_header_0=^?^I'm also curious to see how a Knight's School graduate might handle with this trial. If you've made up your mind, I'm ready to hold a Will Trial for you, [player].
chat_system_2861195_snap_4_answer_1=^?^[s]High difficulty[/s] Ha! That's all you got? Well it's no surprise that your School's graduates are so weak! Our trials were much more difficult than this.
chat_system_2861195_snap_4_header_1=^?^You're far too self-confident and impudent, [player]. Be warned: if you determine to submit to this trial, I will not make any indulgences for you. You'll face just the same challenge that our graduates take.
chat_system_2861195_snap_4_answer_2=^?^[s]Low difficulty[/s] Hmm, I'm impressed. Forgive me for my rudeness - your educational methods are quite effective.
chat_system_2861195_snap_4_header_2=^?^I'm pleased to hear you say it. I see you're not only capable of thinking over what you've heard and soberly assessing your skills, but you are also capable of admitting when you are wrong, and apologize. Believe me - these qualities will serve you well in the future.
chat_system_2861195_switch_5_header_0=^?^There is a myth, a legend, of a time long past. At school you must remember studying an epoch known as the Necromancers' Rebellion? As you will recall, all the necromancers were either eliminated or banished to the Land of Death, and all their horrible black towers and towns were burnt to the ground with sacred fire.<br>But there is one town, a legend about a town I should say, which escaped the inquisition and King Vilor's retribution. With the help of a bloody ceremony - bloody as all the other rites of necromancers - the black art mages managed to conceal the entire town from the eyes of their enemies. And so it disappeared as if it had never existed. But we know for sure that the town was neither destroyed nor taken into the other world. At least not taken entirely...<br>In other words, there was once a town and now there's not. But the curious thing remains that sometimes quite strange individuals and other things appear from nowhere and disappear in the same way. Some of our mages are sure that this town still exists and one could even pass into it! And with the help of the Chronicles we wish to learn how necromancers managed to transport the town to... well, there, where it is now.
chat_system_2861195_switch_4_header_0=^?^It's an old story. As a young student, I was preparing my final report before graduation. And I asked a good friend of mine, Chvakha, a young and quite, ah, promising witch for a bit of help. A month later she had prepared not just a report, but a groundbreaking scientific treatise, with great number of examples and rare specimens. But alas, on the day of the presentation, all these priceless records transformed into a set of stupid and abominable witch's recipes! And to top it all off, a terrible stench arose from out of the papers, which made the whole Council sick, and caused hallucinations!<br>Needless to say, after that, all contact with witches was broken off...
chat_system_2861195_switch_3_header_0=^?^Nothing yet... We don't have any of those kind of specialists. We requested one to be sent from the Academy, but he hasn't arrived yet. Come back later, and maybe we'll have some news. By the way, if you come across anyone who could help us with the Chronicles, please let us know. Money is no object...
chat_system_2861195_switch_0_header_1=^?^I'm sorry, but you're not ready to pass that trial. Maybe you can come back later.<br><br>[s]To enter this trial your Leadership needs to be at least 1000! [/s]
chat_system_2861195_test_start_question=^?^So you've decided to try it? Well, I'd be interested to see how a Knight's School graduate will pass a Trial of Will. But if you want to change your mind, I'll understand...
chat_system_2861195_test_start_answer_0=^?^I'd like to hear again what the trial consists of.
chat_system_2861195_test_start_answer_1=^?^I think, I'll be able to handle it. In fact, I'm sure of it. Let the trial begin!
chat_system_2861195_test_start_answer_2=^?^I've changed my mind, I'm afraid I simply don't have the time just now.
chat_system_2861195_test_start_header_2=^?^Quite understandable, young man. One mustn't make rash decisions, and rush into a fight against poor odds. Come back, when you're more confident in your abilities.
chat_system_2861195_test_start_answer_3=^?^Hmm... Naturally, I'm not afraid at all and I'll surely pass that Trial of... Fear, I meant Pain... No, uh, Trial of Will! - Yes that's what I meant to say. But later. I just remembered that I have a couple of urgent matters which require my immediate attention.
chat_system_2861195_test_start_header_3=^?^Certainly, certainly. Nobody's accusing you of cowardice. You are a very courageous young man, and you simply must be too busy with heroic knightly feats, and other important engagements, heh-heh...<br>Come back later when you've scraped together some courage. Oh, I meant time. Of course, more time! Ha-ha...
chat_system_2861195_info_header_0=^?^Trial of Will... Formerly called the "Student's Trial." Those who failed to pass it were deemed to lack the skills to continue their education. But now the rules are not so severe, and being that you're not a student, there's nothing to fear.<br>The purpose of the Trial is to prove that using only the arts of magic, you are able to defeat a stronger and more experienced enemy, but one who does not share your knowledge of magic.
chat_system_2861195_quest_beast_question=^?^Chicken legs? Herbs?! Who do you take us for, young man? This is a Magic School, an institution for the scientific study of magic - not a Witch's Coven!<br>However, we do need some assistance along similar lines. This year we decided to introduce a new subject: a practice course on directed mutations. And for the research, we need a number of rare species of animals, each of which evolved as a result of spontaneous mutation. Collect them for us and I will see that you're well rewarded!<br>We need: thirty Lake Dragonflies, ten Royal Snakes and one Cyclops.<br>[reward]
chat_system_2861195_quest_beast_answer_0=^?^Sounds good. I agree!
chat_system_2861195_quest_beast_answer_1=^?^Creeping about the forests and caves, in search of snakes and spiders? Knights do not busy themselves with such pursuits. Naturally I must decline your offer!
chat_system_2861195_quest_beast_header_1=^?^If I were you, young man, I wouldn't turn up my nose so high. I'm not talking about gathering snakes and frogs in the swamps, but to search for a few rare species of animals, in order to contribute to the progress of scientific knowledge of magic! I do urge you to reconsider my proposal, young man.
chat_system_2861195_snap_3_question=^?^Excellent! The sooner you find them, the sooner we'll be able to commence our research!<br>I would advise you to have a look at the menagerie first. And do be attentive as you approach the swamp or the lake. Maybe you'll find some eggs.
chat_system_2861195_snap_3_answer_0=^?^Ok, I'll do that.
chat_system_2861195_start_header_0=^?^Ah, [player]! Of course, I remember you. How could I forget? The snakes you kindly brought us managed to creep out of their cages and scare our students to death, until they were all caught. I mean snakes, not the students, of course, ha-ha...<br>Ahem, ah, so what did you want?
chat_system_2861195_start_header_1=^?^I'm glad to see you once more visiting our school, [player]. You couldn't have come at a better time: the senior students have just started their practice. If you need anything, please feel free to ask.
chat_system_2861195_start_header_2=^?^Hmm, [player]. By the way, how good are you with ancient languages? Dead languages, I mean. Hah, dead languages, oh yes - the deader the better. Ahem, we are in the middle of deciphering the Necromancers' Town Chronicles you kindly reacquired for us. We haven't been able to understand much of the text, but we're still quite hopeful of our success!
chat_system_2861195_start_header_3=^?^Good day, traveler. The doors of the Darion Magic School are always open for those who seek knowledge.<br>Or have you visited us in order to take refuge and rest? The school has been built using special spells, and even a short break within its walls will allow you to recover your magical powers.
chat_system_2861195_start_header_4=^?^I'm pleased to see you once again visiting us in the Magic School, young man. What brings you here this time?
chat_system_2861195_start_header_5=^?^Ugh, hum...There you are again, young man. You've come to renew your magical reserves, am I right?
chat_system_2861195_start_header_6=^?^Excuse me, [player], we have a lot of work. So, please, don't distract me over trifles.
chat_system_2861195_test_header_0=^?^So, you've finally made up your mind? I don't know if it's courage or foolishness, but nevertheless I'm interested in how a Knight's School graduate might pass a Student's Trial. You've shown such self-confidence, [player], that I won't insult your dignity by simplifying the terms of the challenge. I shall indeed put you through your paces.
chat_system_2861195_test_header_1=^?^So, you've finally made up your mind? You just can't wait to show off your powers, eh?<br>You are far from the first Knight's School graduate to pass the trial. Usually we simplify the challenge for them, given their natural disadvantage. But for you I'll make an exception, in order not to insult your fine abilities. You like challenges, and you won't become frightened at the crucial moment, will you, bold [player]?
